"""
    函数参数
        实际参数:与形参进行对应
            1. 位置实参:按位置
                3.序列实参：拆
            2. 关键字实参：按名称
                4.字典实参：拆

        形式参数:约束实参
            默认形参：实参可选
            位置形参：实参必填
            命名关键字形参：实参必须是关键字实参
            不定长形参
                星号元组形参：将位置实参合并为元组
                        位置实参数量无限
                双星号字典形参：将关键字实参合并为字典
                        关键字实参数量无限
"""

# 1. 位置形参：实参必填
def func01(p1, p2, p3):
    print(p1)
    print(p2)
    print(p3)


func01(1, 2, 3)


# 2. 星号元组形参：将位置实参合并为元组
# 注意1：形参中只有一个
# 注意2：只支持位置实参
def func02(*args):
    print(args)


func02()
func02(1, 2, 3)


# func02(a=1,b=2)

# 3. p1, p2 是命名关键字形参:
#  限制实参必须是关键字实参
def func03(*args, p1, p2):
    print(args)


func03(1, 2, 3, 4, 5, p1=1, p2=2)


# p1 是必填的信息
# p2 是可选的信息
def func04(p1, *, p2=0):
    print(p1)
    print(p2)


func04(1, p2=2)

# print(10,20,30,end = " ")
print(10, 20, 30, sep="------")
print(10, 20, 30, sep="------", end=" ")


# 如果木有命名关键字形参的技术
# 下列代码可读性非常差的写法,就不能避免了.
# print(10,20,30,"------"," ")

# 4. 双星号字典形参：关键字实参数量无限
def func04(**kwargs):
    print(kwargs)


func04()
func04(a=1, b=2, c=3)
