"""
    编程范式
        面向过程
            考虑问题从步骤(细节/实现)出发
            先做 -- 后用

        面向对象 - 架构
            封装： 分  -- 多个类        [先用]
                老张   (思想层面：汽车   火车...)
            继承： 隔 -- 父类          ------
                交通工具
            多态：做 -- 子类重写        [后做]
                汽车   火车

        函数式编程： - 功能
            "封装"： 分 -- 多个函数     [先用]
               通用函数  (思想层面：姓名是xx的员工  编号是xx的员工...)
            "继承"： 隔 -- 参数        ------
                func
            "多态"：做 -- lambda      [后做]
                姓名是xx的员工   编号是xx的员工
"""